main_lexicon = {'start': lambda name: f'Привет, {name}! Я помогу тебе и твоему другу разрешить любой спор с помощью '
                                      f'всеми известной игры "Камень, ножницы, бумага", либо с помощью броска кубика. '
                                      f'Выбирай, что по душе 😉',
                'stop': 'Прекратить поиск',
                'remind': 'Напомнить 👊',
                'back_to_choice': 'Возвращаемся к выбору игры.',
                'player_is_found': 'Игрок найден! Помни, что играем до трех побед.',
                'player_is_not_found': 'Никого нет😟 Придется немного подождать. '
                                       'Я обязательно сообщу, когда кто-нибудь присоединится.',
                'player_is_not_found_stop': "Устал ждать? Что ж, возвращаемся в лобби...",
                'you_won': 'Ура! Ты выиграл! Поздравляю 🥳',
                'you_lose': 'Увы, ты проиграл 😔. Ничего, выиграешь в следующий раз!'}

rsp_specific = {'begin_rsp': 'Итак...Камень, ножницы, бумага! Отличный выбор. Если внезапно забыл, как играть - '
                             'жми "Помощь". Если не забыл, то ты молодец. Можешь нажимать "Начать! 🤜🏻 🤛🏻". Но ведь '
                             'тебе интересно, кто же эти 10 самых крутых игроков, правда? Если да, то жми "Статистика"',
                'help': 'Серьезно? Ладно, смотри: камень тупит ножницы, ножницы режут бумагу, бумага накрывает камень.'
                        'Проше некуда 😉',
                'chosen': 'Выбор сделан!',
                'choice_is_made': 'Псс..другой игрок уже сделал свой выбор. Поторапливайся😉',
                'lose_round': 'К сожалению ты проиграл☹️ У тебя еще есть шанс отыграться! Жми кнопку',
                'won_round': 'Ты выиграл раунд, но не выиграл войну🤓 Жми кнопку',
                'draw': 'Ваши силы равны! Жми кнопку'}

dice_specific = {'begin_dice': 'Итак, твой выбор упал на кубики 🎲🎲 ',
                 'help': 'У кого выпало больше, тот и выиграл. Все просто 😉'}
